---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextWidthScale
source: html/8250c071-a47c-bc6e-0125-ecbbebaf093a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextWidthScale Property

"Width Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId TextWidthScale { get; }
```